ednieuw/RTCcheck/Old/ESP32_RTCcheckV025/ESP32_RTCcheckV025.ino
      sprintf(sptext, "\n Use of rotary encoder is %s\n"
                        "         Use of keypad is %s\n"
                        "Use of large IR-remote is %s\n"
                        " Use of tiny IR-remote is %s", 
                        Mem.UseRotary == 1 ? "ON" : "OFF", Mem.UseRotary == 2 ? "ON" : "OFF",
                        Mem.UseRotary == 3 ? "ON" : "OFF", Mem.UseRotary == 4 ? "ON" : "OFF");
      Tekstprintln(sptext);      
      sprintf(sptext, "Use DS3231 is %s, WIFI is %s, NTP is %s\n *** Restart clock with @ ***", 
                       Mem.UseDS3231 ? "ON" : "OFF", Mem.WIFIOn ? "ON" : "OFF", Mem.NTPOn ? "ON" : "OFF");     
      if(Mem.UseRotary >2) { while(IrReceiver.decode())  IrReceiver.resume();  }              // Clear all pending commands    
      break;

    case 'I':                                                                                 // Menu
      SWversion(len == 1);                                                                    // true for small menu, false for full menu
      break;
      
    case 'J':                                                                                 // Use DS3231 RTC module
      if(len == 1) 
      {
        Mem.UseDS3231 =  1 - Mem.UseDS3231;
        Mem.NTPOn     = (1 - Mem.UseDS3231);
        if(Mem.WIFIOn == 0) Mem.NTPOn = 0;                                                    // If WIFI is Off then No NTP
        snprintf(sptext, sizeof(sptext), "Use DS3231 is %s, WIFI is %s, NTP is %s", 
                Mem.UseDS3231 ? "ON" : "OFF", Mem.WIFIOn ? "ON" : "OFF", Mem.NTPOn ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter J ****");
      break;
      
    case 'K':  
      snprintf(sptext, sizeof(sptext), "K Test LDR, Print timestamp. K0=Off, K1=per min, K2 is per hour");
      if (len == 1)
        {                                                                                     // Test LDR
         TestLDR = 1 - TestLDR;
         snprintf(sptext, sizeof(sptext), "TestLDR: %s", TestLDR ? "On\n   Bits, Out, loops per second and time" : "Off\n");
        }
       if(InputString.equalsIgnoreCase("K0"))                                                 // Do not log
        {
         Mem.TimeMinute = 0;
         snprintf(sptext, sizeof(sptext), "Time display per minute and hour is: %s", Mem.TimeMinute ? "ON\n" : "OFF\n");  
        } 
       if(InputString.equalsIgnoreCase("K1"))                                                 // Log per minute
        {
         Mem.TimeMinute = 1;
         snprintf(sptext, sizeof(sptext), "Time display per minute is: %s", Mem.TimeMinute ? "ON\n" : "OFF\n");  
        } 
       if(InputString.equalsIgnoreCase("K2"))                                                 // Log per hour
        {
         Mem.TimeMinute = 2;
         snprintf(sptext, sizeof(sptext), "Time display per hour is: %s", Mem.TimeMinute ? "ON\n" : "OFF\n");  
        }       
      break;

       
    case 'L':                                                                                 // Lower brightness
      validLength = (len > 1 && len < 5);
      if(validLength) 
       {
        Mem.LowerBrightness = (byte)SConstrainInt(InputString, 1, 0, 255);
        snprintf(sptext, sizeof(sptext), "Lower brightness: %d bits", Mem.LowerBrightness);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Input fault. \nEnter Lnnn where n between 1 and 255");
      break;
      
    case 'M':                                                                                 // Max brightness
      validLength = (len > 1 && len < 5);
      if(validLength) 
       {
        Mem.UpperBrightness = SConstrainInt(InputString, 1, 1, 255);
        snprintf(sptext, sizeof(sptext), "Upper brightness changed to: %d bits", Mem.UpperBrightness);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Input fault. \nEnter Mnnn where n between 1 and 255");
      break;
      
    case 'N':                                                                                 // Turn off display between hours
      snprintf(sptext, sizeof(sptext), "**** Length fault N. ****");
      if(len == 1) { Mem.TurnOffLEDsAtHH = Mem.TurnOnLEDsAtHH = 0;  } 
      else if(len == 5) 
       {
        Mem.TurnOffLEDsAtHH = (byte)InputString.substring(1, 3).toInt();
        Mem.TurnOnLEDsAtHH  = (byte)InputString.substring(3, 5).toInt();
       }
      Mem.TurnOffLEDsAtHH = _min(Mem.TurnOffLEDsAtHH, 23);
      Mem.TurnOnLEDsAtHH  = _min(Mem.TurnOnLEDsAtHH, 23);
      snprintf(sptext, sizeof(sptext), "Display is OFF between %2d:00 and %2d:00", Mem.TurnOffLEDsAtHH, Mem.TurnOnLEDsAtHH);
      break;
      
    case 'O':                                                                                 // Turn On/Off Display
      if(len == 1) 
       {
        LEDsAreOff = !LEDsAreOff;
        snprintf(sptext, sizeof(sptext), "Display is %s", LEDsAreOff ? "OFF" : "ON");
        if(LEDsAreOff) { ClearScreen(); }
        else 
         {
          Tekstprintln(sptext);
          lastminute = 99;                                                                    // Force display update
          sptext[0]=0;                                                                        // Suppress a second print of sptext
         }
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault O. ****");
      break;
      
    case 'P':                                                                                 // Status LEDs On/Off
      if(len == 1) {
        Mem.StatusLEDOn = !Mem.StatusLEDOn;
        UpdateStatusLEDs(0);
        snprintf(sptext, sizeof(sptext), "StatusLEDs are %s", Mem.StatusLEDOn ? "ON" : "OFF");
      } else snprintf(sptext, sizeof(sptext), "**** Length fault P. ****");
      break;

    case 'Q':                                                                                 // *** Empty *** 
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
       break;

