ednieuw/RTCcheck/Old/ESP32_RTCcheckV025/ESP32_RTCcheckV025.ino
  Serial.print("TCA9548A search on addres 0x");                                               // Test or TCA9548A is available
  Serial.print(TCA_ADDR, HEX);
  Serial.print("... ");
  
  Wire.beginTransmission(TCA_ADDR);
  if (Wire.endTransmission() == 0) {
    Serial.println("FOUND!");
  } else 
  {
    Serial.println("NOT FOUND!\ncheck wiring and power");
    while(1);                                                                                // 
  }  
  Serial.println("\nScanning DS3231 modules...");                                            // Scan which channels a DS3231 has
  for (int i = 0; i < MAX_RTC; i++) 
   {
    selectTCAChannel(i);
    delay(50); 
    Wire.beginTransmission(0x68);                                                            // DS3231 address
    uint8_t error = Wire.endTransmission();
    
    if (error == 0) {Serial.print("DS3231 found on channel "); Serial.println(i);  } 
    else {sprintf(sptext,"No DS3231 on channel %d Error : %d", i,error); Tekstprintln(sptext); }
  }
  Serial.println("\nInitialising RTC modules...");                                            // Initialiseonly found RTC modules
  for (int i = 0; i < MAX_RTC; i++) 
   {
    selectTCAChannel(i);                                                                      // Select multiplexer channel
    delay(50);
    
    Serial.print("Initialising RTC ");
    Serial.print(i);
    Serial.print("... ");
    
    // Test eerst of er een device is
    Wire.beginTransmission(0x68);
    if (Wire.endTransmission() != 0) 
    {
      Serial.println("NO DEVICE");
      continue;
    }
    
    if (!rtc[i].begin()) 
     {
      Serial.println("FAILED!");
      Serial.println("Check connection on channel " + String(i));
      rtcActive[i] = false;
     } 
    else 
     {
      Serial.println("OK!");
      rtcActive[i] = true;
      activeRTCCount++;
      DateTime newTime = rtc[i].now();                                                        // Check time set
      sprintf(sptext,"RTC%d current time: %02d/%02d/%04d %02d:%02d:%02d ",i, newTime.day(),newTime.month(),newTime.year(),
                                                                      newTime.hour(),newTime.minute(),newTime.second());
      Tekstprintln(sptext);  
     }
    delay(100); 
   }
  sprintf(sptext,"Setup finished! %d  RTC modules active.", activeRTCCount);
  Tekstprintln(sptext); 
}

//--------------------------------------------                                                //
// RTC8 Print RTC times
//-------------------------------------------- 
void PrintRTCtimes(void)
{
 for (int i = 0; i < MAX_RTC; i++)                                                           // Read time of all ACTIVE RTC modules
  {
   if (!rtcActive[i]) continue;                                                              // Skip non-active RTC's
   selectTCAChannel(i);                                                                      // Select the RTC channel on the TCA9548A I2C multiplexer
   delay(10);
   DateTime rtcNow = rtc[i].now();
   Tekstprintlnf("RTC %d: %02d/%02d/%04d %02d:%02d:%02d T: %5.2f C",
       i, rtcNow.day(), rtcNow.month(), rtcNow.year(), rtcNow.hour(), rtcNow.minute(), rtcNow.second(), 
       rtc[i].getTemperature());  
  }
}
//--------------------------------------------                                                //
// RTC8 Print RTC differences from NTP
//--------------------------------------------
void PrintDifRTCtimes(void)
{
 Tekstprint("");
 CalcDifRTCtimes();
 for (int i = 0; i < MAX_RTC; i++) 
  {  
   if (!rtcActive[i]) { continue; } 
   Tekstprintf("|T%d:%2ld",i,RTCdiffSec[i]);
  }
 Tekstprintf("|C: %5.2f", GetMedianRTCTemperature());
}
//--------------------------------------------                                                //
// RTC8 Update the time difference in the LEDs
// 1 second sec * -10 GREEN sec * 10 RED
// BLUE is empty
// max time difference = 25 seconds. 26 = NA
//--------------------------------------------
void UpdateRTCTimeLEDs(void)
{
 CalcDifRTCtimes();                                                                          // Calculate difference in sec from NTP
 for (int i = 0; i < MAX_RTC; i++)                                                           // Read time of all ACTIVE RTC modules
  {
   int c;
   if (!rtcActive[i]) c = -1;                                                                // Skip non-active RTC's 
   else c = RTCdiffSec[i]; 
   switch (c)
    {
      case  0 ...  1: ColorLed(i,green);      break;
      case  5 ...  7: ColorLed(i,greenblue);  break;
      case  2 ...  4: ColorLed(i,pink);       break;
      case  8 ... 10: ColorLed(i,darkviolet); break;
      case 11 ... 17: ColorLed(i,purple);     break;
      case 18 ... 25: ColorLed(i,orange);     break;
      case 26 ...999: ColorLed(i,red);        break;
      default:        ColorLed(i,blue); 
    }
  }
SetTempColor(9, GetMedianRTCTemperature());                                                     //Last LED number 10 = led 9
ShowLeds(); 
}

//--------------------------------------------                                                //
// RTC8 Calculate difference in sec from NTP
//-------------------------------------------- 
static time_t To_time_t(const DateTime& dt)
{
 struct tm rtc_tm = {};
 rtc_tm.tm_year  = dt.year()  - 1900;
 rtc_tm.tm_mon   = dt.month() - 1;
 rtc_tm.tm_mday  = dt.day();
 rtc_tm.tm_hour  = dt.hour();
 rtc_tm.tm_min   = dt.minute();
 rtc_tm.tm_sec   = dt.second();
 rtc_tm.tm_isdst = -1;
 return mktime(&rtc_tm);
}

//--------------------------------------------
// RTC8 Calculate difference in sec from NTP
//--------------------------------------------
void CalcDifRTCtimes(void)
{
 struct tm ntp_tm = timeinfo;
 ntp_tm.tm_isdst = -1;
 const time_t tNTP = mktime(&ntp_tm);
 for (int i = 0; i < MAX_RTC; i++)
   {
    if (!rtcActive[i]) { RTCdiffSec[i] = -1; continue; }
    selectTCAChannel(i);
    delay(10);
    RTCdiffSec[i] = abs(tNTP - To_time_t(rtc[i].now()));
   }
}

//--------------------------------------------                                                //
// RTC8 Function to select TCA9548A channel
//--------------------------------------------
void selectTCAChannel(uint8_t channel) 
{
  if (channel > 7) return;                                                                    // Maximaal 8 kanalen (0-7)
  Wire.beginTransmission(TCA_ADDR);
  Wire.write(1 << channel);                                                                   // Select channel by setting bit
  uint8_t error = Wire.endTransmission();
  if (error != 0)  Tekstprintf("Error selecting channel %d Error code : %d", channel,error);
  delay(10);                                                                                  // short delay after channel change
}
//--------------------------------------------                                                //
// RTC8 set Time For RTC 
//--------------------------------------------
void SetTimeForRTC(int rtcIndex, DateTime newTime) 
{
 if (!rtcActive[rtcIndex]) return;
 selectTCAChannel(rtcIndex);
 rtc[rtcIndex].adjust(newTime);
}
//--------------------------------------------                                                //
// RTC8 set current NTP Time For RTC Number X 
//--------------------------------------------
void SetNTPTimeForRTC(int rtcIndex) 
{
 if (!rtcActive[rtcIndex]) return;
 DateTime referenceTime = GetLocalDateTime() + 1;                                            // Get the current time and add 1 sec setting time 
 selectTCAChannel(rtcIndex);
 delay(50);
 DateTime before = rtc[rtcIndex].now();                                                           // Show time before update
 Tekstprintf("RTC %d: before sync %s", rtcIndex, before.timestamp(DateTime::TIMESTAMP_FULL).c_str());
 rtc[rtcIndex].adjust(referenceTime);                                                             // Update time
 delay(50); 
 DateTime after = rtc[rtcIndex].now();                                                            // Verify
 Tekstprintf("RTC %d:  after sync %s", rtcIndex, after.timestamp(DateTime::TIMESTAMP_FULL).c_str());
 Tekstprintln("Synchronisation done!\n");
}

//--------------------------------------------                                                //
// RTC8 Print Time For RTC 
//--------------------------------------------
void PrintTimeForRTC(int rtcIndex) 
{
 if (!rtcActive[rtcIndex]) return;
 selectTCAChannel(rtcIndex);
 DateTime now = rtc[rtcIndex].now();
 Tekstprintf("RTC %d: %s", rtcIndex, now.timestamp(DateTime::TIMESTAMP_FULL).c_str());  
}
//--------------------------------------------                                                //
// RTC8 get Temperature For RTC
//--------------------------------------------
float GetTemperatureForRTC(int rtcIndex) 
{
  if (!rtcActive[rtcIndex]) return -999;
  selectTCAChannel(rtcIndex);
  return rtc[rtcIndex].getTemperature();
}
//--------------------------------------------                                                //
// RTC8 Synchronize all RTC's with current time
// Wait for the second tick per RTC to update that RTC 
//--------------------------------------------
void SynchronizeAllRTCs()   // Zoek eerste actieve RTC als referentie
{
  int referenceRTC = -1;
  for (int i = 0; i < MAX_RTC; i++) { if (rtcActive[i]) { referenceRTC = i;   break;  }  }
  if (referenceRTC == -1)           { Tekstprintln("No active RTC's found!"); return;  }
  
  selectTCAChannel(referenceRTC);
  DateTime referenceTime = GetLocalDateTime() + 1;                                            // Get the current time and add 1 sec setting time  
  Tekstprintln("\n=== RTC SYNCHRONISATION ===");
  Tekstprintlnf("Reference time of NTP RTC %d: %s", referenceRTC, referenceTime.timestamp(DateTime::TIMESTAMP_FULL).c_str());
  for (int i = 0; i < MAX_RTC; i++) 
    {
     if (!rtcActive[i]) continue;
     selectTCAChannel(i);
     time_t t = time(nullptr);                         // Wait for the next clean second boundary
     while (time(nullptr) == t) { delay(1); }         // spin until second ticks over
     DateTime referenceTime = GetLocalDateTime();      // now exactly on the second, no +1 needed
        rtc[i].adjust(referenceTime);
        DateTime after = rtc[i].now();
        Tekstprintlnf("RTC %d: Synced to %s", i, after.timestamp(DateTime::TIMESTAMP_FULL).c_str());
    }
  UpdateRTCTimeLEDs();  
  Tekstprintln("Synchronisation done!\n");
}


//--------------------------------------------                                                //
// RTC8 Set time by hand in serial monitor
//--------------------------------------------
void SetCurrentTime() 
{
 int year, month, day, hour, minute, second;                                                 //
 hour   = timeinfo.tm_hour;
 minute = timeinfo.tm_min;
 second = timeinfo.tm_sec;
 year   = timeinfo.tm_year + 1900;                                                            // Inow.year() is years since 2000 tm_year is years since 1900
 month  = timeinfo.tm_mon  + 1;
 day    = timeinfo.tm_mday;
 DateTime newTime(year, month, day, hour, minute, second);
 Tekstprint("New time: ");
 Tekstprintln(newTime.timestamp(DateTime::TIMESTAMP_FULL).c_str());
 for (int i = 0; i < MAX_RTC; i++) 
    {
     if (!rtcActive[i]) continue;
     selectTCAChannel(i);
     delay(50);      
     DateTime before = rtc[i].now();                                                         // Show time before update
     Tekstprintlnf("RTC %d: before sync %s", i, before.timestamp(DateTime::TIMESTAMP_FULL).c_str());
     rtc[i].adjust(newTime);
     delay(50);
     DateTime after = rtc[i].now();                                                          // Verify
     Tekstprintlnf("RTC %d: after sync %s", i, after.timestamp(DateTime::TIMESTAMP_FULL).c_str());
    }
 UpdateRTCTimeLEDs();     
 Tekstprintln("All active RTC's updated!\n");
}
//--------------------------------------------                                                //
// RTC8 Set Temperature Color
//--------------------------------------------
void SetTempColor(int Lednr, float temp)
{
 temp = constrain(temp, 15.0, 25.0);
 float t = (temp) / 10.0;                         // normalize 0.0 to 1.0
 uint8_t r, g, b;

 if (t < 0.5)                                            // blue to green (15 to 20C)
  {
   float tt = t * 2.0;
   r = 0;
   g = (uint8_t)(255 * tt);
   b = (uint8_t)(255 * (1.0 - tt));
  }
 else                                                     // green to red  (20C to 25C)
  {
   float tt = (t - 0.5) * 2.0;
   r = (uint8_t)(255 * tt);
   g = (uint8_t)(255 * (1.0 - tt));
   b = 0;
  }
 ColorLed(Lednr, ((uint32_t)r << 16) | ((uint32_t)g << 8) | b);
}

//--------------------------------------------                                                //
// RTC8 Get media temperature of all active LEDs
//--------------------------------------------
float GetMedianRTCTemperature(void)
{
 float temps[MAX_RTC];
 int count = 0;

 for (int i = 0; i < MAX_RTC; i++)                       // collect temperatures of active RTC's
  {
   if (!rtcActive[i]) continue;
   selectTCAChannel(i);
   temps[count++] = rtc[i].getTemperature();
  }

 if (count == 0) return -273.0;                          // no active RTC's

 for (int i = 0; i < count - 1; i++)                     // bubble sort
  for (int j = 0; j < count - i - 1; j++)
   if (temps[j] > temps[j+1])
    {
     float tmp  = temps[j];
     temps[j]   = temps[j+1];
     temps[j+1] = tmp;
    }

 if (count % 2 == 0)                                     // even number: average of two middle values
      return (temps[count/2 - 1] + temps[count/2]) / 2.0;
 else return  temps[count/2];                            // odd number: middle value
}

/// --------------------------------- RTC8 



